report.bak/statistics.json
{
  "首页员工统计" : {
    "transaction" : "首页员工统计",
    "sampleCount" : 48,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1151.8541666666667,
    "medianResTime" : 1174.5,
    "minResTime" : 40.0,
    "maxResTime" : 2641.0,
    "pct1ResTime" : 1996.7,
    "pct2ResTime" : 2286.15,
    "pct3ResTime" : 2641.0,
    "throughput" : 2.473971755489125,
    "receivedKBytesPerSec" : 1.1886661168951653,
    "sentKBytesPerSec" : 0.7586202453355324
  },
  "首页部门统计" : {
    "transaction" : "首页部门统计",
    "sampleCount" : 51,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5260.392156862746,
    "medianResTime" : 5696.0,
    "minResTime" : 461.0,
    "maxResTime" : 7146.0,
    "pct1ResTime" : 6651.2,
    "pct2ResTime" : 6835.599999999999,
    "pct3ResTime" : 7146.0,
    "throughput" : 2.872106774793039,
    "receivedKBytesPerSec" : 1.8371386108295318,
    "sentKBytesPerSec" : 0.8947285753505659
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 336,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23051.41964285715,
    "medianResTime" : 6373.0,
    "minResTime" : 40.0,
    "maxResTime" : 73408.0,
    "pct1ResTime" : 69682.8,
    "pct2ResTime" : 71609.75,
    "pct3ResTime" : 72964.23,
    "throughput" : 4.404477885850614,
    "receivedKBytesPerSec" : 26.07372973907401,
    "sentKBytesPerSec" : 1.3912360844388223
  },
  "首页计数统计" : {
    "transaction" : "首页计数统计",
    "sampleCount" : 46,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2801.630434782608,
    "medianResTime" : 3000.5,
    "minResTime" : 165.0,
    "maxResTime" : 4198.0,
    "pct1ResTime" : 3934.0000000000005,
    "pct2ResTime" : 4123.65,
    "pct3ResTime" : 4198.0,
    "throughput" : 2.3696682464454977,
    "receivedKBytesPerSec" : 1.3005405805687205,
    "sentKBytesPerSec" : 0.7266365521327015
  },
  "薪资列表查询" : {
    "transaction" : "薪资列表查询",
    "sampleCount" : 72,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 29100.583333333336,
    "medianResTime" : 29575.5,
    "minResTime" : 23263.0,
    "maxResTime" : 31985.0,
    "pct1ResTime" : 31265.3,
    "pct2ResTime" : 31460.399999999998,
    "pct3ResTime" : 31985.0,
    "throughput" : 1.6561242093156987,
    "receivedKBytesPerSec" : 4.261608683151236,
    "sentKBytesPerSec" : 0.5304772857964347
  },
  "员工列表查询" : {
    "transaction" : "员工列表查询",
    "sampleCount" : 46,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5144.369565217391,
    "medianResTime" : 5673.0,
    "minResTime" : 666.0,
    "maxResTime" : 7313.0,
    "pct1ResTime" : 6759.8,
    "pct2ResTime" : 7141.95,
    "pct3ResTime" : 7313.0,
    "throughput" : 2.476313522825151,
    "receivedKBytesPerSec" : 5.327459658968562,
    "sentKBytesPerSec" : 0.7907759003552971
  },
  "考勤列表查询" : {
    "transaction" : "考勤列表查询",
    "sampleCount" : 73,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 67958.2191780822,
    "medianResTime" : 69399.0,
    "minResTime" : 58358.0,
    "maxResTime" : 73408.0,
    "pct1ResTime" : 72652.6,
    "pct2ResTime" : 72924.3,
    "pct3ResTime" : 73408.0,
    "throughput" : 0.9591632942660431,
    "receivedKBytesPerSec" : 21.33669988289667,
    "sentKBytesPerSec" : 0.3109787243128186
  }
}