report/statistics.json
{
  "登录" : {
    "transaction" : "登录",
    "sampleCount" : 150,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1815.2200000000005,
    "medianResTime" : 2031.5,
    "minResTime" : 104.0,
    "maxResTime" : 4113.0,
    "pct1ResTime" : 3023.7,
    "pct2ResTime" : 3196.649999999999,
    "pct3ResTime" : 3948.780000000003,
    "throughput" : 18.877422602567332,
    "receivedKBytesPerSec" : 15.70660552479235,
    "sentKBytesPerSec" : 4.516570837528317
  },
  "首页员工统计" : {
    "transaction" : "首页员工统计",
    "sampleCount" : 46,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1923.3043478260865,
    "medianResTime" : 2095.0,
    "minResTime" : 77.0,
    "maxResTime" : 3790.0,
    "pct1ResTime" : 3154.1,
    "pct2ResTime" : 3325.7,
    "pct3ResTime" : 3790.0,
    "throughput" : 2.4049772572802843,
    "receivedKBytesPerSec" : 1.1555164165838867,
    "sentKBytesPerSec" : 0.7374637292832122
  },
  "首页部门统计" : {
    "transaction" : "首页部门统计",
    "sampleCount" : 41,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6118.195121951221,
    "medianResTime" : 6440.0,
    "minResTime" : 1859.0,
    "maxResTime" : 8856.0,
    "pct1ResTime" : 8315.2,
    "pct2ResTime" : 8791.1,
    "pct3ResTime" : 8856.0,
    "throughput" : 1.961910230644081,
    "receivedKBytesPerSec" : 1.254932813546751,
    "sentKBytesPerSec" : 0.6111810191166619
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 441,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17765.997732426298,
    "medianResTime" : 4172.0,
    "minResTime" : 77.0,
    "maxResTime" : 75021.0,
    "pct1ResTime" : 68338.40000000001,
    "pct2ResTime" : 71584.5,
    "pct3ResTime" : 74005.94,
    "throughput" : 5.708663965515009,
    "receivedKBytesPerSec" : 26.658306809944207,
    "sentKBytesPerSec" : 1.6564434643240864
  },
  "首页计数统计" : {
    "transaction" : "首页计数统计",
    "sampleCount" : 29,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3661.6551724137926,
    "medianResTime" : 3238.0,
    "minResTime" : 359.0,
    "maxResTime" : 5854.0,
    "pct1ResTime" : 5826.0,
    "pct2ResTime" : 5848.0,
    "pct3ResTime" : 5854.0,
    "throughput" : 1.7752203721841333,
    "receivedKBytesPerSec" : 0.97429086832762,
    "sentKBytesPerSec" : 0.5443546844392753
  },
  "薪资列表查询" : {
    "transaction" : "薪资列表查询",
    "sampleCount" : 64,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28901.578125000004,
    "medianResTime" : 28960.0,
    "minResTime" : 21790.0,
    "maxResTime" : 33520.0,
    "pct1ResTime" : 32387.0,
    "pct2ResTime" : 33179.25,
    "pct3ResTime" : 33520.0,
    "throughput" : 1.492398097192426,
    "receivedKBytesPerSec" : 3.8403017442402763,
    "sentKBytesPerSec" : 0.478033765506949
  },
  "员工列表查询" : {
    "transaction" : "员工列表查询",
    "sampleCount" : 38,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7074.421052631579,
    "medianResTime" : 7302.5,
    "minResTime" : 4223.0,
    "maxResTime" : 9614.0,
    "pct1ResTime" : 9121.1,
    "pct2ResTime" : 9484.8,
    "pct3ResTime" : 9614.0,
    "throughput" : 1.8205337038279117,
    "receivedKBytesPerSec" : 3.9166364741532123,
    "sentKBytesPerSec" : 0.5813618370622334
  },
  "考勤列表查询" : {
    "transaction" : "考勤列表查询",
    "sampleCount" : 73,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 68472.42465753427,
    "medianResTime" : 69734.0,
    "minResTime" : 55364.0,
    "maxResTime" : 75021.0,
    "pct1ResTime" : 73792.2,
    "pct2ResTime" : 74120.6,
    "pct3ResTime" : 75021.0,
    "throughput" : 0.953039936289933,
    "receivedKBytesPerSec" : 21.200485067137095,
    "sentKBytesPerSec" : 0.3089934168440017
  }
}